package ex_LEEJUNMOK03;

public class Ex04 {

}

//<4번 문제> 다음 질문에 간단히 답하라.

//(1) 생성자는 어떤 용도로 쓰이는가? 
	/* 객체를 생성할 때 사용하고, 필드의 값들을 초기화 하는데 사용한다.  */

//(2) 중복 정의된 메소드들은 어떻게 구별되어서 호출되는가?
	/* 파라미터의 개수나 형의 차이를 주어 구별한다. */	

//(3) 키워드 this는 무엇을 가리키는가?
	/* this가 쓰여 있는 객체를 참조할때 쓰임. 인스턴스변수와 파라미터를 구분할때 주로 쓰임.*/

//(4) 정적 변수와 인스턴스 변수의 차이점은 무엇인가?
	/* 정적변수(static Variable)은 하나의 클래스에 하나만 존재하여 다른 객체에서 공유하게 되지만, 
	 * 인스턴스 변수는 개별의 인스턴스에서 모두 따로 생성된다. */

//(5) 객체가 매개 변수로 전달될 때는 어떤 값이 전달되는가?
	/* 객체의 주소(참조값)이 전달된다. 	*/

//(6) 왜 정적 메소드는 인스턴스 변수를 참조할 수 없는가?
	/* 정적메소드는 그 클래스에서 즉시 생성되는데, 인스턴스 변수는 다른 클래스에서 선언을 해줄때 비로서 생성되기 때문에
	 * 아직 선언되지 않은 인스턴스 변수를 정적메소드에서 사용할 수 없다. */

